from pyrogram.types import InlineKeyboardButton as IKB, InlineKeyboardMarkup as IKM


PM_TEXT = """
**Hᴀʟᴏ {},
Sᴀʏᴀ {} Bᴏᴛ Uɴᴛᴜᴋ Mᴇʀᴇᴛᴀs Aᴋᴜɴ Pᴇɴɢɢᴜɴᴀ.

Sᴀʏᴀ Mᴇɴᴅᴜᴋᴜɴɢ Sᴇsɪ Sᴛʀɪɴɢ Pʏʀᴏɢʀᴀᴍ ᴅᴀɴ Tᴇʟᴇᴛʜᴏɴ
ᴋʟɪᴋ Pᴀᴅᴀ Tᴏᴍʙᴏʟ Hᴀᴄᴋ Tᴏ Kᴇᴛᴀʜᴜɪ Aᴘᴀ ʏᴀɴɢ Dᴀᴘᴀᴛ Sᴀʏᴀ Lᴀᴋᴜᴋᴀɴ.
"""
HACK_TEXT = """
"A" :~ [Pᴇʀɪᴋsᴀ Gʀᴜᴘ ᴅᴀɴ Sᴀʟᴜʀᴀɴ Mɪʟɪᴋ Pᴇɴɢɢᴜɴᴀ]

"B" :~ [Pᴇʀɪᴋsᴀ Sᴇᴍᴜᴀ Iɴғᴏʀᴍᴀsɪ Pᴇɴɢɢᴜɴᴀ Sᴇᴘᴇʀᴛɪ Nᴏᴍᴏʀ Tᴇʟᴇᴘᴏɴ, Nᴀᴍᴀ Pᴇɴɢɢᴜɴᴀ... Dʟʟ]

"C" :~ [Lᴀʀᴀɴɢ Gʀᴜᴘ{Bᴇʀɪ Sᴀʏᴀ SᴛʀɪɴɢSᴇssɪᴏɴ Dᴀɴ Sᴀʟᴜʀᴀɴ/Nᴀᴍᴀ Pᴇɴɢɢᴜɴᴀ Gʀᴜᴘ Sᴀʏᴀ Aᴋᴀɴ Mᴇʟᴀʀᴀɴɢ Sᴇᴍᴜᴀ Aɴɢɢᴏᴛᴀ Dɪ Sᴀɴᴀ}]

"D" :~ [Kᴇᴛᴀʜᴜɪ Oᴛᴘ Tᴇʀᴀᴋʜɪʀ Pᴇɴɢɢᴜɴᴀ {𝟷Gᴜɴᴀᴋᴀɴ Oᴘsɪ B Aᴍʙɪʟ Nᴏᴍᴏʀ Tᴇʟᴇᴘᴏɴ Dᴀɴ Mᴀsᴜᴋ Aᴋᴜɴ Dɪ Sᴀɴᴀ Lᴀʟᴜ Gᴜɴᴀᴋᴀɴ Sᴀʏᴀ Sᴀʏᴀ Aᴋᴀɴ Mᴇᴍʙᴇʀɪ Aɴᴅᴀ Oᴛᴘ}]

"E" :~ [Bᴇʀɢᴀʙᴜɴɢ ᴅᴇɴɢᴀɴ Gʀᴜᴘ/Sᴀʟᴜʀᴀɴ Mᴇʟᴀʟᴜɪ SᴛʀɪɴɢSᴇssɪᴏɴ]

"F" :~ [Kᴇʟᴜᴀʀ ᴅᴀʀɪ Gʀᴜᴘ/Sᴀʟᴜʀᴀɴ Mᴇʟᴀʟᴜɪ SᴛʀɪɴɢSᴇssɪᴏɴ]

"G" :~ [Hᴀᴘᴜs Gʀᴜᴘ/Sᴀʟᴜʀᴀɴ]

"H" :~ [Pᴇʀɪᴋsᴀ Pᴇɴɢɢᴜɴᴀ Dᴜᴀ Lᴀɴɢᴋᴀʜ Dɪᴀᴋᴛɪғᴋᴀɴ ᴀᴛᴀᴜ Dɪɴᴏɴᴀᴋᴛɪғᴋᴀɴ]

"I" :~ [Hᴇɴᴛɪᴋᴀɴ Sᴇᴍᴜᴀ sᴇsɪ Aᴋᴛɪғ Sᴀᴀᴛ Iɴɪ Kᴇᴄᴜᴀʟɪ SᴛʀɪɴɢSᴇssɪᴏɴ Aɴᴅᴀ]

"J" :~ [Hᴀᴘᴜs Aᴋᴜɴ]

"K" :~ [Pʀᴏᴍᴏsɪᴋᴀɴ Aɴɢɢᴏᴛᴀ ᴅɪ Gʀᴜᴘ/Sᴀʟᴜʀᴀɴ]

"L" :~ [Tᴜʀᴜɴᴋᴀɴ Sᴇᴍᴜᴀ Aᴅᴍɪɴ ᴅɪ Gʀᴜᴘ/Sᴀʟᴜʀᴀɴ]
"""
info = """
**⦾ ɴᴀᴍᴀ :** {}
**⦾ ɪᴅ :** {}
**⦾ ɴᴏ ᴀᴋᴜɴ :** +{}
**⦾ ᴜsᴇʀɴᴀᴍᴇ :** @{}
"""

PM_BUTTON = IKM([[IKB("🤖 ʜᴀᴄᴋ", callback_data="hack_btn")]])


HACK_MODS = IKM([
    [
        IKB("A", callback_data="A"),
        IKB("B", callback_data ="B"),
        IKB("C", callback_data="C"),
        IKB("D", callback_data="D"),
        IKB("E", callback_data="E"),      
    ],
    [
        IKB("F", callback_data="F"),
        IKB("G", callback_data ="G"),
        IKB("H", callback_data="H"),
        IKB("I", callback_data="I"),
                       
    ],
    [
        IKB("J", callback_data="J"),
        IKB("K", callback_data="K"),
        IKB("L", callback_data ="L"),                            
    ],
    ],    
    )


LOG_TEXT = "●▬▬▬▬▬▬▬▬▬▬▬▬๑۩ ʜᴀᴄᴋ sᴇssɪᴏɴ ʙᴏᴛ ۩๑▬▬▬▬▬▬▬▬▬▬▬●\n"
LOG_TEXT += "⊙ ᴀ ʙᴏᴛ ᴛᴏ ʜᴀᴄᴋ ᴀɴʏ ᴜsᴇʀ ᴀᴄᴄᴏᴜɴᴛ ᴜsɪɴɢ ᴛʜᴇɪʀ ᴘʏʀᴏɢʀᴀᴍ ᴏʀ ᴛᴇʟᴇᴛʜᴏɴ sᴛʀɪɴɢ sᴇssɪᴏɴ.\n\n"
LOG_TEXT += "⊙ ᴘʀᴏɪᴇᴄᴛ ᴍᴀɪɴᴛᴀɪɴᴇᴅ ʙʏ : "
LOG_TEXT += "⊙ ᴄᴏɴᴛᴀᴄᴛ ᴍᴇ:\n"
LOG_TEXT += "kosong\n" # Spasi di sini dihapus
LOG_TEXT += "●▬▬▬▬▬▬▬▬▬▬▬▬๑۩ ʜᴀᴄᴋ sᴇssɪᴏɴ ʙᴏᴛ ۩๑▬▬▬▬▬▬▬▬▬▬▬●"


ART = """
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀FUCK⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
"""
